<template>
  <section>
    <app-header></app-header>

    <main class="container">
      <div>
        <h1>
          Хиты продаж
        </h1>
      </div>
      <section class="products">
        <div  class="v-for" v-for="product in products" :key="product.id">
          <app-product :product="product"> </app-product>
        </div>
      </section>
    </main>

    <app-footer></app-footer>
  </section>

</template>

<script>
export default {
  name: "main",
  data(){
    return{
      products: [
        {
          id: 1,
          title: "Промывочное масло",
          description: "Промывочные масла — это синтетические маловязкие моторные масла со специальным пакетом присадок. В качестве присадок используются различные поверхностно-активные вещества (ПАВ, моющие средства), диспергирующие вещества, компоненты для защиты от задиров и износа металлических деталей, и т.д. Данные средства заливаются в двигатель на короткое время после слива отработанного масла, а после чистки полностью сливаются и утилизируются.",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-lukoil@2x.webp",
          price: 818,
          manufacturer: "Lukoil"
        },
        {
          id: 2,
          title: "Щетка стеклоочистителя зимняя",
          description: "Дворники непосредственно контактируют со снегом, а конструкция классических каркасных щёток стеклоочистителя, увы, совершенно для этого не подходит. Кроме того, дворники находятся в зоне постоянного изменения температуры. Салон автомобиля прогрелся, лобовое стекло оттаяло — снег превратился в воду; салон остыл, вода замёрзла — стекло покрылось льдом. Чтобы сохранять подвижность и работоспособность в таких условиях, щётки должны иметь особую конструкцию.\n Каркасный механизм классического дворника — система из шарниров и коромысел, прижимающая резиновую ленту к стеклу — становится источником проблем зимой. Открытый металл, скопив влагу, моментально покрывается коркой льда, а снег, попадая в шарниры, заклинивает коромысла. В итоге щётки в прямом смысле коченеют, застывая в немыслимых позах, и беспомощно ползают над поверхностью стекла, без единого шанса очистить его. Такая ситуация на дороге в полной мере является аварийной и потенциально опасной, и лучше до неё не доводить, заранее сменив щётки стеклоочистителя на зимние.",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-alca.png",
          price: 1205,
          manufacturer: "Alca"
        },
        {
          id: 3,
          title: "Масло моторное Mobil Super",
          description: "Масла, применяемые для смазывания поршневых и роторных двигателей внутреннего сгорания.\n В зависимости от назначения их подразделяют на масла для дизелей, масла для бензиновых двигателей и универсальные моторные масла, которые предназначены для смазывания двигателей обоих типов. Все современные моторные масла состоят из базовых масел и улучшающих их свойства присадок.",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-mobil-super.webp",
          price: 2569,
          manufacturer: "Mobil"
        },
        {
          id: 4,
          title: "Свеча зажигания",
          description: "Запальная свеча — устройство для воспламенения топливо-воздушной смеси в самых разнообразных тепловых двигателях",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-denso@2x.webp",
          price: 157,
          manufacturer: "Denso"
        },
        {
          id: 5,
          title: "Масляный фильтр HYUNDAI-KIA",
          description: "Устройство, предназначенное для удаления загрязнений из моторных, трансмиссионных, смазочных масел, гидравлических жидкостей (жидкость для автоматической коробки перемены передач, жидкость для гидравлического усилителя рулевого управления) и др.\nАналогично устроены и топливные фильтры (очистка бензина, керосина или дизельного топлива).",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-hyundai@2x.webp",
          price: 368,
          manufacturer: "HYUNDAI/KIA"
        },
        {
          id: 6,
          title: "Масляный фильтр Mann-Filter",
          description: "Устройство, предназначенное для удаления загрязнений из моторных, трансмиссионных, смазочных масел, гидравлических жидкостей (жидкость для автоматической коробки перемены передач, жидкость для гидравлического усилителя рулевого управления) и др.\nАналогично устроены и топливные фильтры (очистка бензина, керосина или дизельного топлива).",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-mann-filter.webp",
          price: 454,
          manufacturer: "Mann"
        },
        {
          id: 7,
          title: "Лампа галогенная Philips Vision",
          description: "Лампа накаливания, в баллон которой добавлен буферный газ: пары галогенов (брома или иода). Буферный газ повышает срок службы лампы до 2000-4000 часов и позволяет повысить температуру спирали. При этом рабочая температура спирали составляет примерно 3000 С.",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-philips@2x.webp",
          price: 197,
          manufacturer: "Philips"
        },
        {
          id: 8,
          title: "Герметик REINZOSIL",
          description: "Пастообразная или вязкотекучая композиция на основе полимеров или олигомеров, которую наносят на болтовые, заклепочные и другие соединения с целью предотвращения утечки рабочей среды через зазоры конструкции, гидроизоляции и для герметизации. Герметизирующий слой образуется непосредственно на соединительном шве в результате отверждения (вулканизации) полимерной основы или испарения растворителя; существуют также герметики, которые после нанесения на герметизируемую поверхность никаких изменений не претерпевают (невысыхающие замазки).",
          img: "https://emex.ru/static/images/main-page-best-offers/pic-reinzolis@2x.webp",
          price: 630,
          manufacturer: "Mahle/Knecht"
        }
      ]
    }
  }
}
</script>

<style scoped src="../assets/styles/main_style.css">

</style>